examples/render_all_grammars/dot/tests_functional_test_import_importoverride_diamond_second.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40928728[ label="{Second|}"]

39836808[ label="{ID|}"]

40342760[ label="{STRING|}"]

40686584[ label="{BOOL|}"]

40431048[ label="{INT|}"]

40360088[ label="{FLOAT|}"]

40804568[ label="{STRICTFLOAT|}"]

39872072[ label="{NUMBER|}"]

39799736[ label="{BASETYPE|}"]

40353000[ label="{*OBJECT|}"]

39960872[ label="{MyDiamondRule|+a:INT\l}"]



40928728 -> 39960872[arrowtail=diamond, dir=both, headlabel="diamond "]
39872072 -> 40804568 [dir=back]
39872072 -> 40431048 [dir=back]
39799736 -> 39872072 [dir=back]
39799736 -> 40360088 [dir=back]
39799736 -> 40686584 [dir=back]
39799736 -> 39836808 [dir=back]
39799736 -> 40342760 [dir=back]
40353000 -> 39799736 [dir=back]

}
